testing/artillery/artillery-test-users-id-tasks-api.yml
#Artillery test for /users/{user_id}/tasks- 10 concurrent requests per second for 5 mins


config:
  target: "https://nsc-func-dev-usw2-tuesday.azurewebsites.net"
  phases:
    - duration: 10
      arrivalRate: 10
      name: "Performance Jen Test"
scenarios:
  - flow:
      - get:
          url: "/api/users/1/tasks"
          json:
            name: "name"