testing/artillery/artillery-test-users-id-tasks-id-api.yml
#Artillery test for /users/{user_id}/tasks/{task_id}- 10 concurrent requests per second for 5 mins


config:
  target: "https://nsc-func-dev-usw2-tuesday.azurewebsites.net/api/users/{userId}/tasks/{taskId}"
  phases:
    - duration: 300
      arrivalRate: 10
      name: "Performance Joanna Test"
scenarios:
  - flow:
      - get:
          url: "/api/users/{user_id}/tasks/{task_id}"
          json:
            name: "name"